#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>


```

terraform
module.static-site.aws_acm_certificate.cert_website: Refreshing state... [id=arn:aws:acm:us-east-1:244530008913:certificate/dcfa8533-059c-4e61-b74a-36f375271bcf]
module.static-site.aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E2PD3PRW2VHT7K]
module.static-site.aws_s3_bucket.website_bucket: Refreshing state... [id=wehu001-static-website-bucket20211012092945691300000001]
module.static-site.aws_route53_record.cert_website_validation: Refreshing state... [id=Z09206346Q85736V5X51__19bee25cd541bd85221d0ab0aabd4aaa.wehu001.thecloudcollege.com._CNAME]
module.static-site.aws_acm_certificate_validation.main: Refreshing state... [id=2021-10-12 09:11:49 +0000 UTC]
module.static-site.aws_s3_bucket_policy.website_bucket_policy: Refreshing state... [id=wehu001-static-website-bucket20211012092945691300000001]
module.static-site.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=EP679DO1JM2WM]
module.static-site.aws_route53_record.wwww_a: Refreshing state... [id=Z09206346Q85736V5X51_wehu001.thecloudcollege.com._A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.static-site.data.aws_iam_policy_document.s3_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_policy"  {
      ~ id      = "2799211618" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2PD3PRW2VHT7K"
                        }
                      - Resource  = "arn:aws:s3:::wehu001-static-website-bucket20211012092945691300000001/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = "s3:ListBucket"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2PD3PRW2VHT7K"
                        }
                      - Resource  = "arn:aws:s3:::wehu001-static-website-bucket20211012092945691300000001"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::wehu001-static-website-bucket20211012092945691300000001/*",
              ~ (known after apply),
            ]
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }
      ~ statement {
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::wehu001-static-website-bucket20211012092945691300000001",
              ~ (known after apply),
            ]
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.static-site.aws_acm_certificate.cert_website must be replaced
+/- resource "aws_acm_certificate" "cert_website" {
      ~ arn                       = "arn:aws:acm:us-east-1:244530008913:certificate/dcfa8533-059c-4e61-b74a-36f375271bcf" -> (known after apply)
      ~ domain_name               = "wehu001.thecloudcollege.com" -> "glenn.thecloudcollege.com" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "wehu001.thecloudcollege.com"
              - resource_record_name  = "_19bee25cd541bd85221d0ab0aabd4aaa.wehu001.thecloudcollege.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_815fcf7b401459f2decb44e2ca87cc06.chvvfdvqrj.acm-validations.aws."
            },
        ] -> (known after apply)
      ~ id                        = "arn:aws:acm:us-east-1:244530008913:certificate/dcfa8533-059c-4e61-b74a-36f375271bcf" -> (known after apply)
      ~ subject_alternative_names = [] -> (known after apply)
      - tags                      = {} -> null
      ~ validation_emails         = [] -> (known after apply)
        # (1 unchanged attribute hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.static-site.aws_acm_certificate_validation.main must be replaced
-/+ resource "aws_acm_certificate_validation" "main" {
      ~ certificate_arn         = "arn:aws:acm:us-east-1:244530008913:certificate/dcfa8533-059c-4e61-b74a-36f375271bcf" -> (known after apply) # forces replacement
      ~ id                      = "2021-10-12 09:11:49 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_19bee25cd541bd85221d0ab0aabd4aaa.wehu001.thecloudcollege.com",
        ] -> (known after apply) # forces replacement
    }

  # module.static-site.aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
      ~ aliases                        = [
          + "glenn.thecloudcollege.com",
          - "wehu001.thecloudcollege.com",
        ]
        id                             = "EP679DO1JM2WM"
        tags                           = {}
        # (16 unchanged attributes hidden)



      - origin {
          - domain_name = "wehu001-static-website-bucket20211012092945691300000001.s3.eu-north-1.amazonaws.com" -> null
          - origin_id   = "E2PD3PRW2VHT7K" -> null

          - s3_origin_config {
              - origin_access_identity = "origin-access-identity/cloudfront/E2PD3PRW2VHT7K" -> null
            }
        }
      + origin {
          + domain_name = (known after apply)
          + origin_id   = "E2PD3PRW2VHT7K"

          + s3_origin_config {
              + origin_access_identity = "origin-access-identity/cloudfront/E2PD3PRW2VHT7K"
            }
        }


      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:244530008913:certificate/dcfa8533-059c-4e61-b74a-36f375271bcf" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
        # (3 unchanged blocks hidden)
    }

  # module.static-site.aws_route53_record.cert_website_validation must be replaced
-/+ resource "aws_route53_record" "cert_website_validation" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "_19bee25cd541bd85221d0ab0aabd4aaa.wehu001.thecloudcollege.com" -> (known after apply)
      ~ id              = "Z09206346Q85736V5X51__19bee25cd541bd85221d0ab0aabd4aaa.wehu001.thecloudcollege.com._CNAME" -> (known after apply)
      ~ name            = "_19bee25cd541bd85221d0ab0aabd4aaa.wehu001.thecloudcollege.com" -> (known after apply) # forces replacement
      ~ records         = [
          - "_815fcf7b401459f2decb44e2ca87cc06.chvvfdvqrj.acm-validations.aws.",
        ] -> (known after apply)
      ~ type            = "CNAME" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.static-site.aws_route53_record.wwww_a must be replaced
-/+ resource "aws_route53_record" "wwww_a" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "wehu001.thecloudcollege.com" -> (known after apply)
      ~ id              = "Z09206346Q85736V5X51_wehu001.thecloudcollege.com._A" -> (known after apply)
      ~ name            = "wehu001.thecloudcollege.com" -> "glenn.thecloudcollege.com" # forces replacement
      - records         = [] -> null
      - ttl             = 0 -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.static-site.aws_s3_bucket.website_bucket must be replaced
-/+ resource "aws_s3_bucket" "website_bucket" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::wehu001-static-website-bucket20211012092945691300000001" -> (known after apply)
      ~ bucket                      = "wehu001-static-website-bucket20211012092945691300000001" -> (known after apply)
      ~ bucket_domain_name          = "wehu001-static-website-bucket20211012092945691300000001.s3.amazonaws.com" -> (known after apply)
      ~ bucket_prefix               = "wehu001-static-website-bucket" -> "glenn-static-website-bucket" # forces replacement
      ~ bucket_regional_domain_name = "wehu001-static-website-bucket20211012092945691300000001.s3.eu-north-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3BAZG2TWCNX0D" -> (known after apply)
      ~ id                          = "wehu001-static-website-bucket20211012092945691300000001" -> (known after apply)
      ~ region                      = "eu-north-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ website_domain              = "s3-website.eu-north-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint            = "wehu001-static-website-bucket20211012092945691300000001.s3-website.eu-north-1.amazonaws.com" -> (known after apply)
        # (2 unchanged attributes hidden)


      ~ website {
            # (2 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.static-site.aws_s3_bucket_policy.website_bucket_policy must be replaced
-/+ resource "aws_s3_bucket_policy" "website_bucket_policy" {
      ~ bucket = "wehu001-static-website-bucket20211012092945691300000001" -> (known after apply) # forces replacement
      ~ id     = "wehu001-static-website-bucket20211012092945691300000001" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2PD3PRW2VHT7K"
                        }
                      - Resource  = "arn:aws:s3:::wehu001-static-website-bucket20211012092945691300000001/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = "s3:ListBucket"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2PD3PRW2VHT7K"
                        }
                      - Resource  = "arn:aws:s3:::wehu001-static-website-bucket20211012092945691300000001"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

Plan: 6 to add, 1 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @glennbech, Action: `pull_request`*